In [4]:
import pandas as pd
import numpy as np
sdata1 = pd.Series(np.arange(5), index = list('daecb'))
sdata1

d    0
a    1
e    2
c    3
b    4
dtype: int64

In [5]:
sdata1.sort_index()

a    1
b    4
c    3
d    0
e    2
dtype: int64

In [6]:
sdata2 = pd.Series([7,2,1,5])
sdata2

0    7
1    2
2    1
3    5
dtype: int64

In [7]:
sdata2.sort_values()

2    1
1    2
3    5
0    7
dtype: int64

In [8]:
frame2 = pd.DataFrame({'b':[4,7,-2,2],
                      'a':[0,1,0,1]})
frame2

   b  a
0  4  0
1  7  1
2 -2  0
3  2  1

In [12]:
frame2.sort_values(by = 'b')

   b  a
2 -2  0
3  2  1
0  4  0
1  7  1

In [16]:
frame2.sort_values(by = 'a')

   b  a
0  4  0
2 -2  0
1  7  1
3  2  1

In [17]:
frame2.sort_values(by = ['a','b'])

   b  a
2 -2  0
0  4  0
3  2  1
1  7  1

In [18]:
frame2.sort_values(by = ['a','b'], ascending=[False,True])

   b  a
3  2  1
1  7  1
2 -2  0
0  4  0

In [20]:
frame2 = pd.DataFrame(np.random.randn(1000,3),
                     columns = ['first','second','third'])
frame2

        first    second     third
0   -0.454207  0.529396 -1.148419
1    0.015247 -1.715088  0.236570
2    0.589667  0.193738  0.035677
3    1.515029 -0.695298  0.338770
4    0.587173  0.153001  0.110528
..        ...       ...       ...
995  0.919090  1.223728  1.858516
996  0.363675  0.409267  1.794672
997  1.519374 -0.494298  0.750337
998 -1.566566 -0.012868  0.095949
999 -0.780517  0.921052  0.501916

[1000 rows x 3 columns]

In [21]:
frame2.mean()

first     0.008739
second   -0.034704
third     0.055797
dtype: float64

In [22]:
frame2.sum()

first      8.739405
second   -34.703577
third     55.796550
dtype: float64

In [23]:
frame2.std()

first     1.028513
second    1.033365
third     0.973464
dtype: float64

In [24]:
frame2.describe()

             first       second        third
count  1000.000000  1000.000000  1000.000000
mean      0.008739    -0.034704     0.055797
std       1.028513     1.033365     0.973464
min      -3.190428    -3.932755    -3.131819
25%      -0.692052    -0.769722    -0.607642
50%      -0.009690    -0.017245     0.083403
75%       0.691689     0.660619     0.713675
max       3.260648     3.742366     2.913232

In [25]:
frame2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   first   1000 non-null   float64
 1   second  1000 non-null   float64
 2   third   1000 non-null   float64
dtypes: float64(3)
memory usage: 23.6 KB

In [27]:
frame2.head(3
           )

      first    second     third
0 -0.454207  0.529396 -1.148419
1  0.015247 -1.715088  0.236570
2  0.589667  0.193738  0.035677

In [28]:
frame2[:3]

      first    second     third
0 -0.454207  0.529396 -1.148419
1  0.015247 -1.715088  0.236570
2  0.589667  0.193738  0.035677

In [32]:
frame3 = pd.DataFrame([[90,80,50,],[77,99,92]],columns=['kor','eng','math'])
frame3

   kor  eng  math
0   90   80    50
1   77   99    92

In [33]:
frame3['kor'].corr(frame3['eng'])

-1.0

In [34]:
frame3.corr()

      kor  eng  math
kor   1.0 -1.0  -1.0
eng  -1.0  1.0   1.0
math -1.0  1.0   1.0

In [35]:
frame3.cov()

        kor    eng   math
kor    84.5 -123.5 -273.0
eng  -123.5  180.5  399.0
math -273.0  399.0  882.0

In [40]:
frame1 = pd.DataFrame(np.random.randn(7,3), columns = ['one','two','three'])
frame1.iloc[:4,1] = np.nan
frame1.iloc[:2,2] = np.nan

In [41]:
frame1.fillna(0)

        one       two     three
0 -0.930495  0.000000  0.000000
1 -0.113684  0.000000  0.000000
2 -2.218345  0.000000  0.505082
3 -0.106363  0.000000  0.334932
4  0.296466 -1.260296  0.576581
5 -1.294732  0.658587 -0.490165
6  0.239678 -0.662203 -0.330704

In [42]:
frame1.fillna({'two': -10, 'three': 10})

        one        two      three
0 -0.930495 -10.000000  10.000000
1 -0.113684 -10.000000  10.000000
2 -2.218345 -10.000000   0.505082
3 -0.106363 -10.000000   0.334932
4  0.296466  -1.260296   0.576581
5 -1.294732   0.658587  -0.490165
6  0.239678  -0.662203  -0.330704

In [43]:
frame1.mean()

one     -0.589639
two     -0.421304
three    0.119145
dtype: float64

In [46]:
frame1 = pd.DataFrame(np.random.randn(7,3), columns = ['one','two','three'])
frame1.iloc[:4,1] = np.nan
frame1.iloc[:2,2] = np.nan
frame1

        one       two     three
0  0.496834       NaN       NaN
1 -0.086153       NaN       NaN
2  1.402335       NaN  1.357476
3  0.617126       NaN -0.256181
4  0.255935  0.714462  0.794256
5 -1.356979  0.392809 -0.193797
6  0.960026  0.868796 -0.226104

In [47]:
frame1.mean()

one      0.327018
two      0.658689
three    0.295130
dtype: float64

In [48]:
frame1.fillna(frame1.mean())

        one       two     three
0  0.496834  0.658689  0.295130
1 -0.086153  0.658689  0.295130
2  1.402335  0.658689  1.357476
3  0.617126  0.658689 -0.256181
4  0.255935  0.714462  0.794256
5 -1.356979  0.392809 -0.193797
6  0.960026  0.868796 -0.226104

In [49]:
frame1.fillna(method='bfill')

        one       two     three
0  0.496834  0.714462  1.357476
1 -0.086153  0.714462  1.357476
2  1.402335  0.714462  1.357476
3  0.617126  0.714462 -0.256181
4  0.255935  0.714462  0.794256
5 -1.356979  0.392809 -0.193797
6  0.960026  0.868796 -0.226104

In [50]:
frame2 = pd.DataFrame([[32,78],[88,99]],
                      columns=['seoul','busan'],
                      index=['first','second'])
frame2

        seoul  busan
first      32     78
second     88     99

In [54]:
frame2['incheon'] = pd.Series({'first':83,'second':71})
frame2

        seoul  busan  incheon
first      32     78       83
second     88     99       71

In [55]:
frame2.loc['third'] = pd.Series([74,63,91], index = ['seoul','busan','incheon'])
frame2

        seoul  busan  incheon
first      32     78       83
second     88     99       71
third      74     63       91

In [56]:
frame3 = pd.DataFrame({'a':np.arange(7),
                       'b':np.arange(7,0,-1),
                       'c':['one','one','one','two','two','two','two'],
                       'd':[0,1,2,0,1,2,3]})
frame3

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [60]:
frame4 = frame3.set_index(['c'])
frame4

     a  b  d
c
one  0  7  0
one  1  6  1
one  2  5  2
two  3  4  0
two  4  3  1
two  5  2  2
two  6  1  3

In [61]:
frame4 = frame3.set_index(['c','d'])
frame4

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [62]:
frame4.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1